apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# The three below are PINNED AT THEIR CURRENT VALUES, not tuned. Enabling the
# symbol above would otherwise move all three, and this has to stay a single-
# variable experiment for the same reason the TX buffer count was returned to 32
# further up: the only question being asked here is WHERE WiFi memory comes
# from, and an answer confounded by three other changes is not an answer.
#
# STATIC_RX_BUFFER_NUM would go 10 -> 16, RX_BA_WIN 6 -> 16 (both in
# esp_wifi/Kconfig, defaulted per SPIRAM_TRY_ALLOCATE_WIFI_LWIP). The BA window
# matters on the air, not just in RAM: the satellite is built with 6, and moving
# only this end changes what the two negotiate.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6

# CACHE_TX_BUFFER_NUM only exists when the symbol above is set, and defaults to
# 32. Pinned to 0 DELIBERATELY, and not as conservatism.
#
# It queues upper-layer packets the driver could not buffer instead of rejecting
# them, which is the wrong trade twice over here. A late audio packet is refused
# at anchor time anyway (ANCHOR_MIN_LEAD_US) -- so the queue buys nothing but
# latency for the thing it delays. And it converts tx-fail, the visible counter
# the whole tuning log at the top of this file is written around, into silence:
# the storm that measured 1016 rejections in 20 s would have shown up as a
# healthy zero with a 32-deep cache in front of it.
#
# Worth trying on its own once the fan-out work needs it. Not smuggled in here.
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=0

# Forward this unit's logs and HEALTH snapshots over the sync socket to a
# laptop collector (see CONFIG_DANCEFLOOR_WIFI_LOGS). Bench only -- off in a
# production flash, where the shipper compiles out entirely. The hub also
# relays every satellite's logs to the collector, so this is the one unit that
# must have it on for centralised capture to work.
CONFIG_DANCEFLOOR_WIFI_LOGS=y
